podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE04Z8M4.h
/****************************************************************************************************//**
 * @file     MKE04Z8M4.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MKE04Z8M4.
 *           Equivalent: SKEAZN8M4, MKE04Z8M4, FRDM-KE04Z
 *
 * @version  V0.0
 * @date     2015/02
 *
 *******************************************************************************************************/

#ifndef MCU_MKE04Z8M4
#define MCU_MKE04Z8M4

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /*!<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /*!<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /*!<   3 Hard Fault, all classes of Fault                                                 */
  SVCall_IRQn                   =  -5,   /*!<  11 System Service Call via SVC instruction                                          */
  PendSV_IRQn                   =  -2,   /*!<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /*!<  15 System Tick Timer                                                                */
/* ----------------------   MKE04Z8M4 VectorTable                    ---------------------- */
  FTMRE_IRQn                    =   5,   /*!<  21 FTMRE Command complete or error                                                  */
  PMC_IRQn                      =   6,   /*!<  22 PMC Low-voltage detect, low-voltage warning                                      */
  IRQ_IRQn                      =   7,   /*!<  23 External Interrupt                                                               */
  I2C0_IRQn                     =   8,   /*!<  24 I2C Interface 0                                                                  */
  SPI0_IRQn                     =  10,   /*!<  26 Serial Peripheral Interface 0                                                    */
  UART0_IRQn                    =  12,   /*!<  28 UART0 Status and error                                                           */
  ADC0_IRQn                     =  15,   /*!<  31 Analogue to Digital Converter 0                                                  */
  ACMP0_IRQn                    =  16,   /*!<  32 Analogue comparator 0                                                            */
  FTM0_IRQn                     =  17,   /*!<  33 Flexible Timer Module 0                                                          */
  FTM2_IRQn                     =  19,   /*!<  35 Flexible Timer Module 2                                                          */
  RTC_IRQn                      =  20,   /*!<  36 Real Time Clock overflow                                                         */
  ACMP1_IRQn                    =  21,   /*!<  37 Analogue comparator 0                                                            */
  PIT_Ch0_IRQn                  =  22,   /*!<  38 Programmable Interrupt Timer Channel 0                                           */
  PIT_Ch1_IRQn                  =  23,   /*!<  39 Programmable Interrupt Timer Channel 1                                           */
  KBI0_IRQn                     =  24,   /*!<  40 Keyboard Interrupt 0                                                             */
  KBI1_IRQn                     =  25,   /*!<  41 Keyboard Interrupt 1                                                             */
  ICS_IRQn                      =  27,   /*!<  43 ICS                                                                              */
  WDOG_IRQn                     =  28,   /*!<  44 Watch dog                                                                        */
  PWT_IRQn                      =  29,   /*!<  45 Pulse Width Timer                                                                */
} IRQn_Type;

/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);
extern void HardFault_Handler(void);
extern void SVC_Handler(void);
extern void PendSV_Handler(void);
extern void SysTick_Handler(void);
extern void FTMRE_IRQHandler(void);
extern void PMC_IRQHandler(void);
extern void IRQ_IRQHandler(void);
extern void I2C0_IRQHandler(void);
extern void SPI0_IRQHandler(void);
extern void UART0_IRQHandler(void);
extern void ADC0_IRQHandler(void);
extern void ACMP0_IRQHandler(void);
extern void FTM0_IRQHandler(void);
extern void FTM2_IRQHandler(void);
extern void RTC_IRQHandler(void);
extern void ACMP1_IRQHandler(void);
extern void PIT_Ch0_IRQHandler(void);
extern void PIT_Ch1_IRQHandler(void);
extern void KBI0_IRQHandler(void);
extern void KBI1_IRQHandler(void);
extern void ICS_IRQHandler(void);
extern void WDOG_IRQHandler(void);
extern void PWT_IRQHandler(void);

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the cm4 Processor and Core Peripherals---------------- */
#define __CM0PLUS_REV                0x0100
#define __MPU_PRESENT            0
#define __NVIC_PRIO_BITS         2
#define __Vendor_SysTickConfig   0
#define __FPU_PRESENT            0

#include "core_cm0plus.h"       /*!< Processor and core peripherals */
#include "system.h"             /*!< Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

#ifndef __O
#define __O volatile
#endif


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */



/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================           ACMP0 (file:ACMP0_MKE)               ================ */
/* ================================================================================ */

/**
 * @brief Analog comparator
 */
typedef struct {                                /*!<       ACMP0 Structure                                              */
   __IO uint8_t   CS;                           /*!< 0000: ACMP Control and Status Register                             */
   __IO uint8_t   C0;                           /*!< 0001: ACMP Control Register 0                                      */
   __IO uint8_t   C1;                           /*!< 0002: ACMP Control Register 1                                      */
   __IO uint8_t   C2;                           /*!< 0003: ACMP Control Register 2                                      */
} ACMP_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'ACMP0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/* ------- CS Bit Fields                            ------ */
#define ACMP0_CS_ACMOD_MASK                      (0x03UL << ACMP0_CS_ACMOD_SHIFT)                    /*!< ACMP0_CS: ACMOD Mask                    */
#define ACMP0_CS_ACMOD_SHIFT                     0                                                   /*!< ACMP0_CS: ACMOD Position                */
#define ACMP0_CS_ACMOD(x)                        (((uint8_t)(((uint8_t)(x))<<ACMP0_CS_ACMOD_SHIFT))&ACMP0_CS_ACMOD_MASK) /*!< ACMP0_CS                                */
#define ACMP0_CS_ACOPE_MASK                      (0x01UL << ACMP0_CS_ACOPE_SHIFT)                    /*!< ACMP0_CS: ACOPE Mask                    */
#define ACMP0_CS_ACOPE_SHIFT                     2                                                   /*!< ACMP0_CS: ACOPE Position                */
#define ACMP0_CS_ACO_MASK                        (0x01UL << ACMP0_CS_ACO_SHIFT)                      /*!< ACMP0_CS: ACO Mask                      */
#define ACMP0_CS_ACO_SHIFT                       3                                                   /*!< ACMP0_CS: ACO Position                  */
#define ACMP0_CS_ACIE_MASK                       (0x01UL << ACMP0_CS_ACIE_SHIFT)                     /*!< ACMP0_CS: ACIE Mask                     */
#define ACMP0_CS_ACIE_SHIFT                      4                                                   /*!< ACMP0_CS: ACIE Position                 */
#define ACMP0_CS_ACF_MASK                        (0x01UL << ACMP0_CS_ACF_SHIFT)                      /*!< ACMP0_CS: ACF Mask                      */
#define ACMP0_CS_ACF_SHIFT                       5                                                   /*!< ACMP0_CS: ACF Position                  */
#define ACMP0_CS_HYST_MASK                       (0x01UL << ACMP0_CS_HYST_SHIFT)                     /*!< ACMP0_CS: HYST Mask                     */
#define ACMP0_CS_HYST_SHIFT                      6                                                   /*!< ACMP0_CS: HYST Position                 */
#define ACMP0_CS_ACE_MASK                        (0x01UL << ACMP0_CS_ACE_SHIFT)                      /*!< ACMP0_CS: ACE Mask                      */
#define ACMP0_CS_ACE_SHIFT                       7                                                   /*!< ACMP0_CS: ACE Position                  */
/* ------- C0 Bit Fields                            ------ */
#define ACMP0_C0_ACNSEL_MASK                     (0x03UL << ACMP0_C0_ACNSEL_SHIFT)                   /*!< ACMP0_C0: ACNSEL Mask                   */
#define ACMP0_C0_ACNSEL_SHIFT                    0                                                   /*!< ACMP0_C0: ACNSEL Position               */
#define ACMP0_C0_ACNSEL(x)                       (((uint8_t)(((uint8_t)(x))<<ACMP0_C0_ACNSEL_SHIFT))&ACMP0_C0_ACNSEL_MASK) /*!< ACMP0_C0                                */
#define ACMP0_C0_ACPSEL_MASK                     (0x03UL << ACMP0_C0_ACPSEL_SHIFT)                   /*!< ACMP0_C0: ACPSEL Mask                   */
#define ACMP0_C0_ACPSEL_SHIFT                    4                                                   /*!< ACMP0_C0: ACPSEL Position               */
#define ACMP0_C0_ACPSEL(x)                       (((uint8_t)(((uint8_t)(x))<<ACMP0_C0_ACPSEL_SHIFT))&ACMP0_C0_ACPSEL_MASK) /*!< ACMP0_C0                                */
/* ------- C1 Bit Fields                            ------ */
#define ACMP0_C1_DACVAL_MASK                     (0x3FUL << ACMP0_C1_DACVAL_SHIFT)                   /*!< ACMP0_C1: DACVAL Mask                   */
#define ACMP0_C1_DACVAL_SHIFT                    0                                                   /*!< ACMP0_C1: DACVAL Position               */
#define ACMP0_C1_DACVAL(x)                       (((uint8_t)(((uint8_t)(x))<<ACMP0_C1_DACVAL_SHIFT))&ACMP0_C1_DACVAL_MASK) /*!< ACMP0_C1                                */
#define ACMP0_C1_DACREF_MASK                     (0x01UL << ACMP0_C1_DACREF_SHIFT)                   /*!< ACMP0_C1: DACREF Mask                   */
#define ACMP0_C1_DACREF_SHIFT                    6                                                   /*!< ACMP0_C1: DACREF Position               */
#define ACMP0_C1_DACEN_MASK                      (0x01UL << ACMP0_C1_DACEN_SHIFT)                    /*!< ACMP0_C1: DACEN Mask                    */
#define ACMP0_C1_DACEN_SHIFT                     7                                                   /*!< ACMP0_C1: DACEN Position                */
/* ------- C2 Bit Fields                            ------ */
#define ACMP0_C2_ACIPE_MASK                      (0x07UL << ACMP0_C2_ACIPE_SHIFT)                    /*!< ACMP0_C2: ACIPE Mask                    */
#define ACMP0_C2_ACIPE_SHIFT                     0                                                   /*!< ACMP0_C2: ACIPE Position                */
#define ACMP0_C2_ACIPE(x)                        (((uint8_t)(((uint8_t)(x))<<ACMP0_C2_ACIPE_SHIFT))&ACMP0_C2_ACIPE_MASK) /*!< ACMP0_C2                                */

