podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE04Z8M4.h
/* CRC - Peripheral instance base addresses */
#define CRC_BasePtr                    0x40032000UL
#define CRC                            ((CRC_Type *) CRC_BasePtr)
#define CRC_BASE_PTR                   (CRC)

/* ================================================================================ */
/* ================           FGPIOA (file:FGPIOA_MKE)             ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
typedef struct {                                /*!<       FGPIOA Structure                                             */
   union {                                      /*!< 0000: (size=0004)                                                  */
      __IO uint32_t  PDOR;                      /*!< 0000: Port Data Output Register                                    */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __IO uint8_t   PDORA;                  /*!< 0000: Port Data Output Register                                    */
         __IO uint8_t   PDORB;                  /*!< 0001: Port Data Output Register                                    */
         __IO uint8_t   PDORC;                  /*!< 0002: Port Data Output Register                                    */
         __IO uint8_t   PDORD;                  /*!< 0003: Port Data Output Register                                    */
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __O  uint32_t  PSOR;                      /*!< 0004: Port Set Output Register                                     */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __O  uint8_t   PSORA;                  /*!< 0004: Port Set Output Register                                     */
         __O  uint8_t   PSORB;                  /*!< 0005: Port Set Output Register                                     */
         __O  uint8_t   PSORC;                  /*!< 0006: Port Set Output Register                                     */
         __O  uint8_t   PSORD;                  /*!< 0007: Port Set Output Register                                     */
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __O  uint32_t  PCOR;                      /*!< 0008: Port Clear Output Register                                   */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __O  uint8_t   PCORA;                  /*!< 0008: Port Clear Output Register                                   */
         __O  uint8_t   PCORB;                  /*!< 0009: Port Clear Output Register                                   */
         __O  uint8_t   PCORC;                  /*!< 000A: Port Clear Output Register                                   */
         __O  uint8_t   PCORD;                  /*!< 000B: Port Clear Output Register                                   */
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __O  uint32_t  PTOR;                      /*!< 000C: Port Toggle Output Register                                  */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __O  uint8_t   PTORA;                  /*!< 000C: Port Toggle Output Register                                  */
         __O  uint8_t   PTORB;                  /*!< 000D: Port Toggle Output Register                                  */
         __O  uint8_t   PTORC;                  /*!< 000E: Port Toggle Output Register                                  */
         __O  uint8_t   PTORD;                  /*!< 000F: Port Toggle Output Register                                  */
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __I  uint32_t  PDIR;                      /*!< 0010: Port Data Input Register                                     */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __I  uint8_t   PDIRA;                  /*!< 0010: Port Data Input Register                                     */
         __I  uint8_t   PDIRB;                  /*!< 0011: Port Data Input Register                                     */
         __I  uint8_t   PDIRC;                  /*!< 0012: Port Data Input Register                                     */
         __I  uint8_t   PDIRD;                  /*!< 0013: Port Data Input Register                                     */
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __IO uint32_t  PDDR;                      /*!< 0014: Port Data Direction Register                                 */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __IO uint8_t   PDDRA;                  /*!< 0014: Port Data Direction Register                                 */
         __IO uint8_t   PDDRB;                  /*!< 0015: Port Data Direction Register                                 */
         __IO uint8_t   PDDRC;                  /*!< 0016: Port Data Direction Register                                 */
         __IO uint8_t   PDDRD;                  /*!< 0017: Port Data Direction Register                                 */
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __IO uint32_t  PIDR;                      /*!< 0018: Port Input Disable Register                                  */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __IO uint8_t   PIDRA;                  /*!< 0018: Port Input Disable Register                                  */
         __IO uint8_t   PIDRB;                  /*!< 0019: Port Input Disable Register                                  */
         __IO uint8_t   PIDRC;                  /*!< 001A: Port Input Disable Register                                  */
         __IO uint8_t   PIDRD;                  /*!< 001B: Port Input Disable Register                                  */
      };
   };
} GPIOA_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOA' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

