podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE04Z8M4.h
#define FTM_PWMLOAD_CH4SEL_SHIFT                 4                                                   /*!< FTM2_PWMLOAD: CH4SEL Position           */
#define FTM_PWMLOAD_CH5SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH5SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH5SEL Mask               */
#define FTM_PWMLOAD_CH5SEL_SHIFT                 5                                                   /*!< FTM2_PWMLOAD: CH5SEL Position           */
#define FTM_PWMLOAD_CH6SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH6SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH6SEL Mask               */
#define FTM_PWMLOAD_CH6SEL_SHIFT                 6                                                   /*!< FTM2_PWMLOAD: CH6SEL Position           */
#define FTM_PWMLOAD_CH7SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH7SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH7SEL Mask               */
#define FTM_PWMLOAD_CH7SEL_SHIFT                 7                                                   /*!< FTM2_PWMLOAD: CH7SEL Position           */
#define FTM_PWMLOAD_LDOK_MASK                    (0x01UL << FTM_PWMLOAD_LDOK_SHIFT)                  /*!< FTM2_PWMLOAD: LDOK Mask                 */
#define FTM_PWMLOAD_LDOK_SHIFT                   9                                                   /*!< FTM2_PWMLOAD: LDOK Position             */

/* FTM2 - Peripheral instance base addresses */
#define FTM2_BasePtr                   0x4003A000UL
#define FTM2                           ((FTM2_Type *) FTM2_BasePtr)
#define FTM2_BASE_PTR                  (FTM2)

/* ================================================================================ */
/* ================           FTMRE (file:FTMRE_MKE_2)             ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Interface
 */
typedef struct {                                /*!<       FTMRE Structure                                              */
   __I  uint8_t   RESERVED0;                    /*!< 0000:                                                              */
   __IO uint8_t   FCCOBIX;                      /*!< 0001: Flash CCOB Index Register                                    */
   __IO uint8_t   FSEC;                         /*!< 0002: Flash Security Register                                      */
   __IO uint8_t   FCLKDIV;                      /*!< 0003: Flash Clock Divider Register                                 */
   __I  uint8_t   RESERVED1;                    /*!< 0004:                                                              */
   __IO uint8_t   FSTAT;                        /*!< 0005: Flash Status Register                                        */
   __I  uint8_t   RESERVED2;                    /*!< 0006:                                                              */
   __IO uint8_t   FCNFG;                        /*!< 0007: Flash Configuration Register                                 */
   union {                                      /*!< 0000: (size=0002)                                                  */
      __IO uint16_t  FCCOB;                     /*!< 0008: Flash Common Command Object Register (FCCOBLO:FCCOBHI)       */
      struct {                                  /*!< 0000: (size=0002)                                                  */
         __IO uint8_t   FCCOBLO;                /*!< 0008: Flash Common Command Object Register:Low                     */
         __IO uint8_t   FCCOBHI;                /*!< 0009: Flash Common Command Object Register:High                    */
      };
   };
   __I  uint8_t   RESERVED3;                    /*!< 000A:                                                              */
   __IO uint8_t   FPROT;                        /*!< 000B: Flash Protection Register                                    */
   __I  uint8_t   RESERVED4[3];                 /*!< 000C:                                                              */
   __IO uint8_t   FOPT;                         /*!< 000F: Flash Option Register                                        */
} FTMRE_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FTMRE' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/* ------- FCCOBIX Bit Fields                       ------ */
#define FTMRE_FCCOBIX_CCOBIX_MASK                (0x07UL << FTMRE_FCCOBIX_CCOBIX_SHIFT)              /*!< FTMRE_FCCOBIX: CCOBIX Mask              */
#define FTMRE_FCCOBIX_CCOBIX_SHIFT               0                                                   /*!< FTMRE_FCCOBIX: CCOBIX Position          */
#define FTMRE_FCCOBIX_CCOBIX(x)                  (((uint8_t)(((uint8_t)(x))<<FTMRE_FCCOBIX_CCOBIX_SHIFT))&FTMRE_FCCOBIX_CCOBIX_MASK) /*!< FTMRE_FCCOBIX                           */
/* ------- FSEC Bit Fields                          ------ */
#define FTMRE_FSEC_SEC_MASK                      (0x03UL << FTMRE_FSEC_SEC_SHIFT)                    /*!< FTMRE_FSEC: SEC Mask                    */
#define FTMRE_FSEC_SEC_SHIFT                     0                                                   /*!< FTMRE_FSEC: SEC Position                */
#define FTMRE_FSEC_SEC(x)                        (((uint8_t)(((uint8_t)(x))<<FTMRE_FSEC_SEC_SHIFT))&FTMRE_FSEC_SEC_MASK) /*!< FTMRE_FSEC                              */
#define FTMRE_FSEC_KEYEN_MASK                    (0x03UL << FTMRE_FSEC_KEYEN_SHIFT)                  /*!< FTMRE_FSEC: KEYEN Mask                  */
#define FTMRE_FSEC_KEYEN_SHIFT                   6                                                   /*!< FTMRE_FSEC: KEYEN Position              */
#define FTMRE_FSEC_KEYEN(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRE_FSEC_KEYEN_SHIFT))&FTMRE_FSEC_KEYEN_MASK) /*!< FTMRE_FSEC                              */
/* ------- FCLKDIV Bit Fields                       ------ */
#define FTMRE_FCLKDIV_FDIV_MASK                  (0x3FUL << FTMRE_FCLKDIV_FDIV_SHIFT)                /*!< FTMRE_FCLKDIV: FDIV Mask                */
#define FTMRE_FCLKDIV_FDIV_SHIFT                 0                                                   /*!< FTMRE_FCLKDIV: FDIV Position            */
#define FTMRE_FCLKDIV_FDIV(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRE_FCLKDIV_FDIV_SHIFT))&FTMRE_FCLKDIV_FDIV_MASK) /*!< FTMRE_FCLKDIV                           */
#define FTMRE_FCLKDIV_FDIVLCK_MASK               (0x01UL << FTMRE_FCLKDIV_FDIVLCK_SHIFT)             /*!< FTMRE_FCLKDIV: FDIVLCK Mask             */
#define FTMRE_FCLKDIV_FDIVLCK_SHIFT              6                                                   /*!< FTMRE_FCLKDIV: FDIVLCK Position         */
#define FTMRE_FCLKDIV_FDIVLD_MASK                (0x01UL << FTMRE_FCLKDIV_FDIVLD_SHIFT)              /*!< FTMRE_FCLKDIV: FDIVLD Mask              */
#define FTMRE_FCLKDIV_FDIVLD_SHIFT               7                                                   /*!< FTMRE_FCLKDIV: FDIVLD Position          */
/* ------- FSTAT Bit Fields                         ------ */
#define FTMRE_FSTAT_MGSTAT_MASK                  (0x03UL << FTMRE_FSTAT_MGSTAT_SHIFT)                /*!< FTMRE_FSTAT: MGSTAT Mask                */
#define FTMRE_FSTAT_MGSTAT_SHIFT                 0                                                   /*!< FTMRE_FSTAT: MGSTAT Position            */
#define FTMRE_FSTAT_MGSTAT(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRE_FSTAT_MGSTAT_SHIFT))&FTMRE_FSTAT_MGSTAT_MASK) /*!< FTMRE_FSTAT                             */
#define FTMRE_FSTAT_MGBUSY_MASK                  (0x01UL << FTMRE_FSTAT_MGBUSY_SHIFT)                /*!< FTMRE_FSTAT: MGBUSY Mask                */
#define FTMRE_FSTAT_MGBUSY_SHIFT                 3                                                   /*!< FTMRE_FSTAT: MGBUSY Position            */
#define FTMRE_FSTAT_FPVIOL_MASK                  (0x01UL << FTMRE_FSTAT_FPVIOL_SHIFT)                /*!< FTMRE_FSTAT: FPVIOL Mask                */
#define FTMRE_FSTAT_FPVIOL_SHIFT                 4                                                   /*!< FTMRE_FSTAT: FPVIOL Position            */
#define FTMRE_FSTAT_ACCERR_MASK                  (0x01UL << FTMRE_FSTAT_ACCERR_SHIFT)                /*!< FTMRE_FSTAT: ACCERR Mask                */
#define FTMRE_FSTAT_ACCERR_SHIFT                 5                                                   /*!< FTMRE_FSTAT: ACCERR Position            */
#define FTMRE_FSTAT_CCIF_MASK                    (0x01UL << FTMRE_FSTAT_CCIF_SHIFT)                  /*!< FTMRE_FSTAT: CCIF Mask                  */
#define FTMRE_FSTAT_CCIF_SHIFT                   7                                                   /*!< FTMRE_FSTAT: CCIF Position              */
/* ------- FCNFG Bit Fields                         ------ */
#define FTMRE_FCNFG_FSFD_MASK                    (0x01UL << FTMRE_FCNFG_FSFD_SHIFT)                  /*!< FTMRE_FCNFG: FSFD Mask                  */
#define FTMRE_FCNFG_FSFD_SHIFT                   0                                                   /*!< FTMRE_FCNFG: FSFD Position              */
#define FTMRE_FCNFG_FDFD_MASK                    (0x01UL << FTMRE_FCNFG_FDFD_SHIFT)                  /*!< FTMRE_FCNFG: FDFD Mask                  */
#define FTMRE_FCNFG_FDFD_SHIFT                   1                                                   /*!< FTMRE_FCNFG: FDFD Position              */
#define FTMRE_FCNFG_IGNSF_MASK                   (0x01UL << FTMRE_FCNFG_IGNSF_SHIFT)                 /*!< FTMRE_FCNFG: IGNSF Mask                 */
#define FTMRE_FCNFG_IGNSF_SHIFT                  4                                                   /*!< FTMRE_FCNFG: IGNSF Position             */
#define FTMRE_FCNFG_CCIE_MASK                    (0x01UL << FTMRE_FCNFG_CCIE_SHIFT)                  /*!< FTMRE_FCNFG: CCIE Mask                  */
#define FTMRE_FCNFG_CCIE_SHIFT                   7                                                   /*!< FTMRE_FCNFG: CCIE Position              */
/* ------- FCCOB Bit Fields                         ------ */
/* ------- FCCOBLO Bit Fields                       ------ */
/* ------- FCCOBHI Bit Fields                       ------ */
/* ------- FPROT Bit Fields                         ------ */
#define FTMRE_FPROT_FPLS_MASK                    (0x03UL << FTMRE_FPROT_FPLS_SHIFT)                  /*!< FTMRE_FPROT: FPLS Mask                  */
#define FTMRE_FPROT_FPLS_SHIFT                   0                                                   /*!< FTMRE_FPROT: FPLS Position              */
#define FTMRE_FPROT_FPLS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRE_FPROT_FPLS_SHIFT))&FTMRE_FPROT_FPLS_MASK) /*!< FTMRE_FPROT                             */
#define FTMRE_FPROT_FPLDIS_MASK                  (0x01UL << FTMRE_FPROT_FPLDIS_SHIFT)                /*!< FTMRE_FPROT: FPLDIS Mask                */
#define FTMRE_FPROT_FPLDIS_SHIFT                 2                                                   /*!< FTMRE_FPROT: FPLDIS Position            */
#define FTMRE_FPROT_FPOPEN_MASK                  (0x01UL << FTMRE_FPROT_FPOPEN_SHIFT)                /*!< FTMRE_FPROT: FPOPEN Mask                */
#define FTMRE_FPROT_FPOPEN_SHIFT                 7                                                   /*!< FTMRE_FPROT: FPOPEN Position            */
/* ------- FOPT Bit Fields                          ------ */

