podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE04Z8M4.h
/* PORT - Peripheral instance base addresses */
#define PORT_BasePtr                   0x40049000UL
#define PORT                           ((PORT_Type *) PORT_BasePtr)
#define PORT_BASE_PTR                  (PORT)

/* ================================================================================ */
/* ================           PWT (file:PWT_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Pulse Width Timer
 */
typedef struct {                                /*!<       PWT Structure                                                */
   __IO uint32_t  R1;                           /*!< 0000: Pulse Width Timer Register 1                                 */
   __IO uint32_t  R2;                           /*!< 0004: Pulse Width Timer Register 2                                 */
} PWT_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'PWT' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/* ------- R1 Bit Fields                            ------ */
#define PWT_R1_PWTOV_MASK                        (0x01UL << PWT_R1_PWTOV_SHIFT)                      /*!< PWT_R1: PWTOV Mask                      */
#define PWT_R1_PWTOV_SHIFT                       0                                                   /*!< PWT_R1: PWTOV Position                  */
#define PWT_R1_PWTRDY_MASK                       (0x01UL << PWT_R1_PWTRDY_SHIFT)                     /*!< PWT_R1: PWTRDY Mask                     */
#define PWT_R1_PWTRDY_SHIFT                      1                                                   /*!< PWT_R1: PWTRDY Position                 */
#define PWT_R1_PWTSR_MASK                        (0x01UL << PWT_R1_PWTSR_SHIFT)                      /*!< PWT_R1: PWTSR Mask                      */
#define PWT_R1_PWTSR_SHIFT                       3                                                   /*!< PWT_R1: PWTSR Position                  */
#define PWT_R1_POVIE_MASK                        (0x01UL << PWT_R1_POVIE_SHIFT)                      /*!< PWT_R1: POVIE Mask                      */
#define PWT_R1_POVIE_SHIFT                       4                                                   /*!< PWT_R1: POVIE Position                  */
#define PWT_R1_PRDYIE_MASK                       (0x01UL << PWT_R1_PRDYIE_SHIFT)                     /*!< PWT_R1: PRDYIE Mask                     */
#define PWT_R1_PRDYIE_SHIFT                      5                                                   /*!< PWT_R1: PRDYIE Position                 */
#define PWT_R1_PWTIE_MASK                        (0x01UL << PWT_R1_PWTIE_SHIFT)                      /*!< PWT_R1: PWTIE Mask                      */
#define PWT_R1_PWTIE_SHIFT                       6                                                   /*!< PWT_R1: PWTIE Position                  */
#define PWT_R1_PWTEN_MASK                        (0x01UL << PWT_R1_PWTEN_SHIFT)                      /*!< PWT_R1: PWTEN Mask                      */
#define PWT_R1_PWTEN_SHIFT                       7                                                   /*!< PWT_R1: PWTEN Position                  */
#define PWT_R1_PRE_MASK                          (0x07UL << PWT_R1_PRE_SHIFT)                        /*!< PWT_R1: PRE Mask                        */
#define PWT_R1_PRE_SHIFT                         8                                                   /*!< PWT_R1: PRE Position                    */
#define PWT_R1_PRE(x)                            (((uint32_t)(((uint32_t)(x))<<PWT_R1_PRE_SHIFT))&PWT_R1_PRE_MASK) /*!< PWT_R1                                  */
#define PWT_R1_EDGE_MASK                         (0x03UL << PWT_R1_EDGE_SHIFT)                       /*!< PWT_R1: EDGE Mask                       */
#define PWT_R1_EDGE_SHIFT                        11                                                  /*!< PWT_R1: EDGE Position                   */
#define PWT_R1_EDGE(x)                           (((uint32_t)(((uint32_t)(x))<<PWT_R1_EDGE_SHIFT))&PWT_R1_EDGE_MASK) /*!< PWT_R1                                  */
#define PWT_R1_PINSEL_MASK                       (0x03UL << PWT_R1_PINSEL_SHIFT)                     /*!< PWT_R1: PINSEL Mask                     */
#define PWT_R1_PINSEL_SHIFT                      13                                                  /*!< PWT_R1: PINSEL Position                 */
#define PWT_R1_PINSEL(x)                         (((uint32_t)(((uint32_t)(x))<<PWT_R1_PINSEL_SHIFT))&PWT_R1_PINSEL_MASK) /*!< PWT_R1                                  */
#define PWT_R1_PCLKS_MASK                        (0x01UL << PWT_R1_PCLKS_SHIFT)                      /*!< PWT_R1: PCLKS Mask                      */
#define PWT_R1_PCLKS_SHIFT                       15                                                  /*!< PWT_R1: PCLKS Position                  */
#define PWT_R1_PPW_MASK                          (0xFFFFUL << PWT_R1_PPW_SHIFT)                      /*!< PWT_R1: PPW Mask                        */
#define PWT_R1_PPW_SHIFT                         16                                                  /*!< PWT_R1: PPW Position                    */
#define PWT_R1_PPW(x)                            (((uint32_t)(((uint32_t)(x))<<PWT_R1_PPW_SHIFT))&PWT_R1_PPW_MASK) /*!< PWT_R1                                  */
/* ------- R2 Bit Fields                            ------ */

/* PWT - Peripheral instance base addresses */
#define PWT_BasePtr                    0x40033000UL
#define PWT                            ((PWT_Type *) PWT_BasePtr)
#define PWT_BASE_PTR                   (PWT)

/* ================================================================================ */
/* ================           RTC (file:RTC_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Real-time counter
 */
typedef struct {                                /*!<       RTC Structure                                                */
   __IO uint32_t  SC;                           /*!< 0000: Status and Control Register                                  */
   __IO uint32_t  MOD;                          /*!< 0004: Modulo Register: Contains the modulo value used to reset the count to 0x0000 upon a compare match and set SC[RTIF] status field */
   __I  uint32_t  CNT;                          /*!< 0008: Counter Register: Reset or writing different values to SC[RTCLKS] and SC[RTCPS] clear the count to 0x0000 */
} RTC_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'RTC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/* ------- SC Bit Fields                            ------ */
#define RTC_SC_RTCO_MASK                         (0x01UL << RTC_SC_RTCO_SHIFT)                       /*!< RTC_SC: RTCO Mask                       */
#define RTC_SC_RTCO_SHIFT                        4                                                   /*!< RTC_SC: RTCO Position                   */
#define RTC_SC_RTIE_MASK                         (0x01UL << RTC_SC_RTIE_SHIFT)                       /*!< RTC_SC: RTIE Mask                       */
#define RTC_SC_RTIE_SHIFT                        6                                                   /*!< RTC_SC: RTIE Position                   */
#define RTC_SC_RTIF_MASK                         (0x01UL << RTC_SC_RTIF_SHIFT)                       /*!< RTC_SC: RTIF Mask                       */
#define RTC_SC_RTIF_SHIFT                        7                                                   /*!< RTC_SC: RTIF Position                   */
#define RTC_SC_RTCPS_MASK                        (0x07UL << RTC_SC_RTCPS_SHIFT)                      /*!< RTC_SC: RTCPS Mask                      */
#define RTC_SC_RTCPS_SHIFT                       8                                                   /*!< RTC_SC: RTCPS Position                  */
#define RTC_SC_RTCPS(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_SC_RTCPS_SHIFT))&RTC_SC_RTCPS_MASK) /*!< RTC_SC                                  */
#define RTC_SC_RTCLKS_MASK                       (0x03UL << RTC_SC_RTCLKS_SHIFT)                     /*!< RTC_SC: RTCLKS Mask                     */
#define RTC_SC_RTCLKS_SHIFT                      14                                                  /*!< RTC_SC: RTCLKS Position                 */
#define RTC_SC_RTCLKS(x)                         (((uint32_t)(((uint32_t)(x))<<RTC_SC_RTCLKS_SHIFT))&RTC_SC_RTCLKS_MASK) /*!< RTC_SC                                  */
/* ------- MOD Bit Fields                           ------ */
#define RTC_MOD_MOD_MASK                         (0xFFFFUL << RTC_MOD_MOD_SHIFT)                     /*!< RTC_MOD: MOD Mask                       */
#define RTC_MOD_MOD_SHIFT                        0                                                   /*!< RTC_MOD: MOD Position                   */
#define RTC_MOD_MOD(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_MOD_MOD_SHIFT))&RTC_MOD_MOD_MASK) /*!< RTC_MOD                                 */
/* ------- CNT Bit Fields                           ------ */
#define RTC_CNT_CNT_MASK                         (0xFFFFUL << RTC_CNT_CNT_SHIFT)                     /*!< RTC_CNT: CNT Mask                       */
#define RTC_CNT_CNT_SHIFT                        0                                                   /*!< RTC_CNT: CNT Position                   */
#define RTC_CNT_CNT(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_CNT_CNT_SHIFT))&RTC_CNT_CNT_MASK) /*!< RTC_CNT                                 */

/* RTC - Peripheral instance base addresses */
#define RTC_BasePtr                    0x4003D000UL
#define RTC                            ((RTC_Type *) RTC_BasePtr)
#define RTC_BASE_PTR                   (RTC)

/* ================================================================================ */
/* ================           SIM (file:SIM_MKE04Z8M4)             ================ */
/* ================================================================================ */

/**
 * @brief System Integration Module
 */
typedef struct {                                /*!<       SIM Structure                                                */
   __IO uint32_t  SRSID;                        /*!< 0000: System Reset Status and ID Register                          */
   __IO uint32_t  SOPT;                         /*!< 0004: System Options Register                                      */
   __IO uint32_t  PINSEL;                       /*!< 0008: Pin Selection Register 0                                     */
   __IO uint32_t  SCGC;                         /*!< 000C: System Clock Gating Control Register                         */
   __IO uint32_t  UUIDL;                        /*!< 0010: Universally Unique Identifier Low Register                   */
   __IO uint32_t  UUIDH;                        /*!< 0014: Universally Unique Identifier Middle Low Register            */
   __IO uint32_t  UUIDMH;                       /*!< 0018: Universally Unique Identifier Middle High Register           */
   __IO uint32_t  CLKDIV;                       /*!< 001C: BUS Clock Divider Register                                   */
} SIM_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'SIM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

